2025-08-17-Sunday-is-a-busy-day.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content" class="content">
<p>
#+Title Sunday is a busy day
</p>


<div id="outline-container-orge2c6737" class="outline-2">
<h2 id="orge2c6737">In the saddle</h2>
<div class="outline-text-2" id="text-orge2c6737">
<p>
We got up fairly early for a Sunday this morning and went for a longish (for us) bike ride. So far today I have put in about 9 miles. No, it is nowhere near the amount of miles I used to put in on a ride but they were super enjoyable miles. I had forgotten the simple joy of being out for a ride in the early hours of the morning just spinng the crank and trying to get the heart rate up. I have no ambitions of being a racer anymore or trying to trek acroos the country or anything like that. I just want to ride.
</p>

<p>
I am doing this mostly for my health. We really don't get just gobs of exercise. Yes, I am in a rather physical job but it really doesn't get the heart rate up and doing the job is becoming more painful with each passing year. Doing my job hurts enough now that I am not sure that I will last much longer in it. I am falling apart.
</p>

<p>
I doubt cycling is going to fix that but it is a very nice stress breaker. I am relaxed in the saddle. I guess it is just being outside doing something and having the sun and wind on your skin, I don't know.
</p>

<p>
After the ride and checking the all the cyber crap that I wear and carry while exercising I discovered that I am not getting my heart rate up to the aerobic level. Well, I can hit aerobic and anaerobic levels I just don't know how to maintain them for any length of time. In an hour long ride today the heart rate hit aerobic levels for only five minutes and anerobic for five minutes. My understanding is that I need more of an aerobic work out. Got to study up on how to do that. Simply put, I just don't know how. 
</p>
</div>
</div>

<div id="outline-container-org29b5023" class="outline-2">
<h2 id="org29b5023">Tech stuff</h2>
<div class="outline-text-2" id="text-org29b5023">
<p>
Mostly due to being sick and tired of seeing AI generated slop and egregious privacy violations I am retreating from most of the popular online schlock that is out there. No mas using of Meta or Alphabet products and I am returning to FOSS software for the most part. Now for those that don't speak geek what that means is that I won't be showing up on Facebook, Instagram, Threads, Google Meet, Twitter, What'sApp, etc and et al.
</p>

<p>
Most of my online presence will be this <a href="https://ragamuffinjim.github.io">blog</a>, <a href="mailto:ragamuffinjim@gmail.com">email</a>, RSS feeds, and a Matrix account (@ragamuffinjim:matrix.org)for instant messaging and <a href="https://mastodon.social/@ragamuffinjim">mastodon</a> account for microblogging.
</p>

<p>
I do have to keep a Google presence for work purposes and that is, coincidentally, my email too,. I have yet to figure out what to do with my burgeoning YouTube empire (HAHA) but everytime I get on the poplar sites I am just disgusted by them and want little to nothing to do with them.
</p>

<p>
So, a large part of the rest of today will be the tweaking of things in my new empire. Say hello to your new geek overlord HEHEHE!
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.3 (<a href="https://orgmode.org">Org</a> mode 9.6.15)</p>
</div>
</body>
</html>
